BrandworksBGIC/ipc_camera/chip/rts3917/sdk/rts39xx_sdk_v5.3/platform/source/drivers/wifi/rtl8723cu/core/rtw_mlme_ext.c
#if 0 /* move to validate_recv_mgnt_frame */
	if (_rtw_memcmp(GetAddr3Ptr(pframe), get_my_bssid(&pmlmeinfo->network), ETH_ALEN)) {
		if (pmlmeinfo->state & WIFI_FW_ASSOC_SUCCESS) {
			psta = rtw_get_stainfo(pstapriv, get_addr2_ptr(pframe));
			if (psta != NULL)
				psta->sta_stats.rx_mgnt_pkts++;
		}
	}
#endif

	return _SUCCESS;

}

/* for 11n Logo 4.2.31/4.2.32 */
#ifdef CONFIG_AP_MODE
static void rtw_check_legacy_ap(_adapter *padapter, u8 *pframe, u32 len)
{
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;

	if (!padapter->registrypriv.wifi_spec)
		return;

	if(!MLME_IS_AP(padapter))
		return;

	if (pmlmeext->bstart_bss == _TRUE) {
		int left;
		unsigned char *pos;
		struct rtw_ieee802_11_elems *elems = NULL;
#ifdef CONFIG_80211N_HT
		/*u16 cur_op_mode;*/
#endif
		elems = (struct rtw_ieee802_11_elems *)rtw_zmalloc(sizeof(struct rtw_ieee802_11_elems));
		if (!elems)
			return;
		/* checking IEs */
		left = len - sizeof(struct rtw_ieee80211_hdr_3addr) - _BEACON_IE_OFFSET_;
		pos = pframe + sizeof(struct rtw_ieee80211_hdr_3addr) + _BEACON_IE_OFFSET_;
		if (rtw_ieee802_11_parse_elems(pos, left, elems, 1) == ParseFailed) {
			RTW_INFO("%s: parse fail for "MAC_FMT"\n", __func__, MAC_ARG(GetAddr3Ptr(pframe)));
			rtw_mfree(elems, sizeof(struct rtw_ieee802_11_elems));
			return;
		}
#ifdef CONFIG_80211N_HT
		/*cur_op_mode = pmlmepriv->ht_op_mode & HT_INFO_OPERATION_MODE_OP_MODE_MASK;*/
#endif
		/* for legacy ap */
		if (elems->ht_capabilities == NULL && elems->ht_capabilities_len == 0) {

			if (0)
				RTW_INFO("%s: "MAC_FMT" is legacy ap\n", __func__, MAC_ARG(GetAddr3Ptr(pframe)));

			ATOMIC_SET(&pmlmepriv->olbc, _TRUE);
			ATOMIC_SET(&pmlmepriv->olbc_ht, _TRUE);
		}
		rtw_mfree(elems, sizeof(struct rtw_ieee802_11_elems));
	}
}
#endif /* CONFIG_AP_MODE */

static u8 auth_null_update_cur_network(_adapter *adapter, union recv_frame *rframe)
{
	WLAN_BSSID_EX *bss;
	u8 ret = _FAIL;

	bss = rtw_malloc(sizeof(*bss));
	if (!bss)
		goto exit;

	if (collect_bss_info(adapter, rframe, bss) == _SUCCESS) {
		struct mlme_priv *pmlmepriv = &adapter->mlmepriv;
		struct mlme_ext_priv *pmlmeext = &adapter->mlmeextpriv;
		struct mlme_ext_info *pmlmeinfo = &pmlmeext->mlmext_info;
		u8 *whdr = rframe->u.hdr.rx_data;
		uint flen = rframe->u.hdr.len;
		struct beacon_keys recv_bcn_keys;
		struct wlan_network *scanned;

		/* get bcn key from received beacon */
		if (rtw_get_bcn_keys(adapter, whdr, flen, &recv_bcn_keys) != _TRUE) {
			RTW_WARN(FUNC_ADPT_FMT" get beacon keys failed\n", FUNC_ADPT_ARG(adapter));
			goto free_bss;
		}
		if (is_hidden_ssid(recv_bcn_keys.ssid, recv_bcn_keys.ssid_len)) {
			_rtw_memcpy(recv_bcn_keys.ssid, pmlmeinfo->network.Ssid.Ssid, IW_ESSID_MAX_SIZE);
			recv_bcn_keys.ssid_len = pmlmeinfo->network.Ssid.SsidLength;
		}

		scanned = rtw_find_network(&pmlmepriv->scanned_queue, get_my_bssid(&pmlmeinfo->network));
		if (!scanned) {
			RTW_WARN(FUNC_ADPT_FMT" can't get scanned network\n", FUNC_ADPT_ARG(adapter));
			ret = RTW_ABORT_LINKING;
			goto free_bss;
		}
		if (!scanned->bcn_keys_valid) {
			RTW_WARN(FUNC_ADPT_FMT" scanned beacon keys not valid\n", FUNC_ADPT_ARG(adapter));
			ret = RTW_ABORT_LINKING;
			goto free_bss;
		}
		if (!rtw_bcn_key_compare(&scanned->bcn_keys, &recv_bcn_keys)) {
			RTW_WARN(FUNC_ADPT_FMT" recv beacon keys conflict with scanned\n", FUNC_ADPT_ARG(adapter));
			RTW_INFO(FUNC_ADPT_FMT" scanned beacon key:\n", FUNC_ADPT_ARG(adapter));
			rtw_dump_bcn_keys(RTW_DBGDUMP, &scanned->bcn_keys);
			RTW_INFO(FUNC_ADPT_FMT" recv beacon key:\n", FUNC_ADPT_ARG(adapter));
			rtw_dump_bcn_keys(RTW_DBGDUMP, &recv_bcn_keys);
			ret = RTW_ABORT_LINKING;
			goto free_bss;
		}

		/* update bcn keys */
		RTW_INFO(FUNC_ADPT_FMT" beacon keys ready\n", FUNC_ADPT_ARG(adapter));
		_rtw_memcpy(&pmlmepriv->cur_beacon_keys, &recv_bcn_keys, sizeof(recv_bcn_keys));

		/* update cur_network */
		update_network(&pmlmepriv->cur_network.network, bss, adapter, _TRUE);

		#ifdef CONFIG_BCN_CNT_CONFIRM_HDL
		pmlmepriv->new_beacon_cnts = 0;
		#endif

		ret = _SUCCESS;
	}

free_bss:
	rtw_mfree(bss, sizeof(*bss));

exit:
	return ret;
}

unsigned int OnBeacon(_adapter *padapter, union recv_frame *precv_frame)
{
	struct sta_info	*psta;
	struct mlme_ext_priv	*pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	struct sta_priv	*pstapriv = &padapter->stapriv;
	u8 *pframe = precv_frame->u.hdr.rx_data;
	uint len = precv_frame->u.hdr.len;
	int ret = _SUCCESS;
#ifdef CONFIG_TDLS
	struct sta_info *ptdls_sta;
	struct tdls_info *ptdlsinfo = &padapter->tdlsinfo;
#ifdef CONFIG_TDLS_CH_SW
	struct tdls_ch_switch *pchsw_info = &padapter->tdlsinfo.chsw_info;
#endif
#endif /* CONFIG_TDLS */
#ifdef	CONFIG_LAYER2_ROAMING
	_irqL irqL;
#endif

	if (validate_bcn_and_probe_rsp_len(pframe, len) == _FALSE)
		return _SUCCESS;

	if (mlmeext_chk_scan_state(pmlmeext, SCAN_PROCESS)
		|| (MLME_IS_MESH(padapter) && check_fwstate(pmlmepriv, WIFI_ASOC_STATE))
	) {
		if (_rtw_memcmp(GetAddr3Ptr(pframe), get_my_bssid(&pmlmeinfo->network), ETH_ALEN)
			&& (pmlmeinfo->state & 0x03) == WIFI_FW_STATION_STATE && (pmlmeinfo->state & WIFI_FW_ASSOC_SUCCESS)
		) {
			if (!rtw_check_bcn_info(padapter, pframe, len)) {
				RTW_PRINT(FUNC_ADPT_FMT" ap has changed, disconnect now\n", FUNC_ADPT_ARG(padapter));
				receive_disconnect(padapter, pmlmeinfo->network.MacAddress , 0, _FALSE);
			}
		}

		rtw_mi_report_survey_event(padapter, precv_frame);
		return _SUCCESS;
	}

#ifdef CONFIG_WRITE_BCN_LEN_TO_FW
	if (check_fwstate(pmlmepriv, WIFI_ASOC_STATE)
		&& (_rtw_memcmp(GetAddr3Ptr(pframe), get_my_bssid(&pmlmeinfo->network), ETH_ALEN))) {
		struct rx_pkt_attrib *pattrib = &precv_frame->u.hdr.attrib;

		if (pmlmeinfo->last_bcn_len != pattrib->pkt_len) {
			pmlmeinfo->last_bcn_len = pattrib->pkt_len;
			rtw_write_bcnlen_to_fw_cmd(padapter, pattrib->pkt_len);
		}
	}
#endif

#ifdef CONFIG_RTW_REPEATER_SON
	if (padapter->rtw_rson_scanstage == RSON_SCAN_PROCESS)
		rtw_mi_report_survey_event(padapter, precv_frame);
#endif

