BrandworksBGIC/ipc_camera/chip/rts3917/sdk/rts39xx_sdk_v5.3/platform/source/drivers/wifi/rtl8723cu/core/rtw_mlme_ext.c
#ifdef CONFIG_80211AC_VHT
		case EID_VHTCapability:
			VHT_caps_handler(adapter, pIE);
			#ifdef ROKU_PRIVATE
			VHT_caps_handler_infra_ap(adapter, pIE);
			#endif /* ROKU_PRIVATE */
			break;

		case EID_VHTOperation:
			VHT_operation_handler(adapter, pIE);
			break;
#endif /* CONFIG_80211AC_VHT */

		case _ERPINFO_IE_:
			ERP_IE_handler(adapter, pIE);
			break;

#ifdef CONFIG_TDLS
		case WLAN_EID_EXT_CAP:
			if (check_ap_tdls_prohibited(pIE->data, pIE->Length) == _TRUE)
				adapter->tdlsinfo.ap_prohibited = _TRUE;
			if (check_ap_tdls_ch_switching_prohibited(pIE->data, pIE->Length) == _TRUE)
				adapter->tdlsinfo.ch_switch_prohibited = _TRUE;
			break;
#endif /* CONFIG_TDLS */

#ifdef CONFIG_RTW_80211K
		case _EID_RRM_EN_CAP_IE_:
			RM_IE_handler(adapter, pIE);
			break;
#endif

#ifdef ROKU_PRIVATE
		/* Infra mode, used to store AP's info , Parse the supported rates from AssocRsp */
		case _SUPPORTEDRATES_IE_:
			Supported_rate_infra_ap(adapter, pIE);
			break;

		case _EXT_SUPPORTEDRATES_IE_:
			Extended_Supported_rate_infra_ap(adapter, pIE);
			break;
#endif /* ROKU_PRIVATE */
		default:
			break;
		}

		i += (pIE->Length + 2);
	}
}

/* Reference from OnAssocRsp() */
static void rtw_csa_parse_beacon_ie(_adapter *adapter)
{
	WLAN_BSSID_EX *cur_network = &(adapter->mlmepriv.cur_network.network);
	u8 *bcn_ie = cur_network->IEs + _BEACON_IE_OFFSET_;
	u32 bcn_len = cur_network->IELength - _BEACON_IE_OFFSET_;

	rtw_update_mlme(adapter, bcn_ie, bcn_len);
}

/* Reference from rtw_joinbss_update_stainfo() and update_sta_info() */
static void rtw_csa_sta_update_stainfo(_adapter *adapter, struct sta_info *psta)
{
	struct mlme_ext_priv *pmlmeext = &(adapter->mlmeextpriv);
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	struct mlme_priv *pmlmepriv = &(adapter->mlmepriv);
	WLAN_BSSID_EX *cur_network = &(adapter->mlmepriv.cur_network.network);

	update_wireless_mode(adapter);
	psta->wireless_mode = pmlmeext->cur_wireless_mode;
	rtw_hal_update_sta_wset(adapter, psta);

	/* update supported rate */
	psta->bssratelen = rtw_get_rateset_len(cur_network->SupportedRates);
	_rtw_memcpy(psta->bssrateset, cur_network->SupportedRates, psta->bssratelen);

	/* update supported MCS set */
	#ifdef CONFIG_80211N_HT
	if (pmlmepriv->htpriv.ht_option) {
		psta->htpriv.ht_option = _TRUE;
		_rtw_memcpy(psta->htpriv.ht_cap.supp_mcs_set,
				pmlmeinfo->HT_caps.u.HT_cap_element.MCS_rate, 16);
	} else {
		psta->htpriv.ht_option = _FALSE;
		_rtw_memset(&(psta->htpriv), 0, sizeof(struct ht_priv));
	}
	#endif

	/* update all VHT IEs includes VHT supported MCS set */
	#ifdef CONFIG_80211AC_VHT
	if (pmlmepriv->vhtpriv.vht_option) {
		psta->vhtpriv.vht_option = _TRUE;
		_rtw_memcpy(&psta->vhtpriv, &pmlmepriv->vhtpriv, sizeof(struct vht_priv));
	} else {
		psta->vhtpriv.vht_option = _FALSE;
		_rtw_memset(&(psta->vhtpriv), 0, sizeof(struct vht_priv));
	}
	psta->cmn.ra_info.is_vht_enable = psta->vhtpriv.vht_option;
	#endif

	rtw_hal_update_sta_ra_info(adapter, psta);

	psta->cmn.bw_mode = pmlmeext->cur_bwmode;
	#ifdef CONFIG_80211N_HT
	psta->htpriv.ch_offset = pmlmeext->cur_ch_offset;
	#endif
}

u8 rtw_csa_sta_update_cap_hdl(_adapter *adapter, unsigned char *pbuf)
{
	struct sta_info *psta = NULL;
	struct mlme_priv *pmlmepriv = &(adapter->mlmepriv);
	struct mlme_ext_info *pmlmeinfo = &(adapter->mlmeextpriv.mlmext_info);
	struct beacon_keys *cur_beacon = &(pmlmepriv->cur_beacon_keys);

	RTW_INFO(FUNC_ADPT_FMT"\n", FUNC_ADPT_ARG(adapter));
	psta = rtw_get_stainfo(&adapter->stapriv, get_bssid(&adapter->mlmepriv));
	if (psta == NULL) {
		RTW_ERR("csa : "FUNC_ADPT_FMT", update sta_info fail\n",
				FUNC_ADPT_ARG(adapter));
		return H2C_SUCCESS;
	}

	#ifdef CONFIG_80211N_HT
	if (cur_beacon->proto_cap & PROTO_CAP_11N) {
		pmlmepriv->htpriv.ht_option = _TRUE;
		pmlmeinfo->HT_enable = _TRUE;
	} else {
		pmlmepriv->htpriv.ht_option = _FALSE;
		pmlmeinfo->HT_enable = _FALSE;
	}
	#endif

	#ifdef CONFIG_80211AC_VHT
	if (cur_beacon->proto_cap & PROTO_CAP_11AC) {
		pmlmepriv->vhtpriv.vht_option = _TRUE;
		pmlmeinfo->VHT_enable = _TRUE;
	} else {
		pmlmepriv->vhtpriv.vht_option = _FALSE;
		pmlmeinfo->VHT_enable = _FALSE;
	}
	#endif

	/* parse new beacon ie from current network to update protocol information */
	rtw_csa_parse_beacon_ie(adapter);

	/* update sta_info from protocol information */
	rtw_csa_sta_update_stainfo(adapter, psta);

	/* update RA mask */
	set_sta_rate(adapter, psta);

	return H2C_SUCCESS;
}

u8 tdls_hdl(_adapter *padapter, unsigned char *pbuf)
{
#ifdef CONFIG_TDLS
	_irqL irqL;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	struct tdls_info *ptdlsinfo = &padapter->tdlsinfo;
#ifdef CONFIG_TDLS_CH_SW
	struct tdls_ch_switch *pchsw_info = &ptdlsinfo->chsw_info;
#endif
	struct TDLSoption_param *TDLSoption;
	struct sta_info *ptdls_sta = NULL;
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info *pmlmeinfo = &pmlmeext->mlmext_info;
	struct sta_info *ap_sta = rtw_get_stainfo(&padapter->stapriv, get_my_bssid(&(pmlmeinfo->network)));
	u8 survey_channel, i, min, option;
	struct tdls_txmgmt txmgmt;
	u32 setchtime, resp_sleep = 0, wait_time;
	u8 zaddr[ETH_ALEN] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
	u8 ret;
	u8 doiqk;
	u64 tx_ra_bitmap = 0;

	if (!pbuf)
		return H2C_PARAMETERS_ERROR;

	TDLSoption = (struct TDLSoption_param *)pbuf;
	option = TDLSoption->option;

	if (!_rtw_memcmp(TDLSoption->addr, zaddr, ETH_ALEN)) {
		ptdls_sta = rtw_get_stainfo(&(padapter->stapriv), TDLSoption->addr);
		if (ptdls_sta == NULL)
			return H2C_REJECTED;
	} else {
		if (!(option == TDLS_RS_RCR))
			return H2C_REJECTED;
	}

	/* _enter_critical_bh(&(ptdlsinfo->hdl_lock), &irqL); */
	/* RTW_INFO("[%s] option:%d\n", __FUNCTION__, option); */

	switch (option) {
	case TDLS_ESTABLISHED: {
		/* As long as TDLS handshake success, we should set RCR_CBSSID_DATA bit to 0 */
		/* So we can receive all kinds of data frames. */
		u8 sta_band = 0;

		/* leave ALL PS when TDLS is established */
		rtw_pwr_wakeup(padapter);

		rtw_hal_rcr_set_chk_bssid(padapter, MLME_TDLS_LINKED);
		RTW_INFO("Created Direct Link with "MAC_FMT"\n", MAC_ARG(ptdls_sta->cmn.mac_addr));

